drop view if exists 会员订单视图;
create view 会员订单视图(会员编号,姓名,订单编号,订单状态,商品编号,购买数量,订单日期) 
as select 订单信息表.会员编号,会员信息表.姓名,订单信息表.订单编号,订单信息表.订单状态,订单详情表.商品编号,订单详情表.购买数量,订单信息表.订单日期 
from 订单信息表,会员信息表,订单详情表 
where 订单信息表.会员编号=会员信息表.会员编号 and 订单信息表.订单编号=订单详情表.订单编号;

drop view if exists 销售情况视图;
create view 销售情况视图(商品编号,购买数量,订单日期) 
as select 订单详情表.商品编号,订单详情表.购买数量,订单信息表.订单日期 
from 订单信息表,订单详情表 where 订单信息表.订单状态='y' and 订单信息表.订单编号=订单详情表.订单编号;

drop view if exists 会员购物车视图;
create view 会员购物车视图(会员编号,姓名,购物车编号,商品编号,商品数量) 
as select 购物车信息表.会员编号,会员信息表.姓名,购物车信息表.购物车编号,购物车详情表.商品编号,购物车详情表.商品数量
from 购物车信息表,会员信息表,购物车详情表 
where 购物车信息表.会员编号=会员信息表.会员编号 and 购物车信息表.购物车编号=购物车详情表.购物车编号;